{
  "basics": {
    "name": "Clément Goubier",
    "label": "Back-end Developer",
    "email": "clement.goubier@gmail.com",
    "phone": "+33 6 79 03 88",
    "url": "",
    "image": "/resume/me.jpeg",
    "summary": "Back-end Developer with extensive experience in developing and maintaining scalable applications for various industries, utilizing PHP, Symfony, React and other modern technologies.",
    "theme": "blue",
    "location": {
      "address": "",
      "postalCode": "94550",
      "city": "Chevilly-Larue",
      "countryCode": "FR",
      "region": "Île-de-France"
    },
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "clementgoubier",
        "url": "https://linkedin.com/in/clementgoubier"
      },
      {
        "network": "GitHub",
        "username": "clmntgbr",
        "url": "https://github.com/clmntgbr"
      }
    ]
  },
  "work": [
    {
      "name": "Display Interactive",
      "location": "Montrouge, Île-de-France",
      "description": "Empower airlines to embrace innovative in-flight digital strategies with UGO, an IFE engagement solution !",
      "position": "Full stack developer",
      "url": "https://www.display.aero",
      "startDate": "2022-03-07",
      "summary": "Develop and maintain websites, back-office systems, and onboard solutions for airline clients. Collaborated with international teams to ensure high-quality project delivery, applied agile principles, and implemented processes to maintain consistent code quality.",
      "responsibilities": [
        "Developed and maintained websites and back-office systems tailored for airline clients.",
        "Installed and configured onboard software solutions for aviation clients.",
        "Conducted on-site testing and wrote detailed specifications with clients across multiple regions.",
        "Contributed to the evolution and maintenance of existing projects.",
        "Implemented processes to ensure consistent code quality.",
        "Organized sprints and followed agile principles to manage project development effectively."
      ],
      "achievements": [
        "Successfully deployed onboard solutions for multiple airline clients.",
        "Established a robust framework for maintaining consistent code quality across projects.",
        "Improved client satisfaction by delivering tailored solutions and conducting thorough on-site testing and requirement gathering."
      ],
      "skills": [
        "React",
        "PHP 8",
        "Symfony 7",
        "AWS",
        "API REST",
        "Ansible",
        "Docker",
        "Ansible",
        "PHPUnit",
        "Behat",
        "Gitlab",
        "MySQL",
        "MariaDB",
        "Kubernetes",
        "RabbitMQ"
      ],
      "location_type": "Hybrid",
      "endDate": null,
      "highlights": []
    },
    {
      "name": "Webcentric",
      "location": "Paris, Île-de-France",
      "description": "A digital agency in Paris building solutions for companies !",
      "position": "Full stack developer",
      "url": "https://www.wcentric.com",
      "startDate": "2021-10-01",
      "endDate": "2022-03-04",
      "summary": "Developed and maintained high-load websites, back-office systems, and mobile applications for B2B clients across diverse industries such as manufacturing and events. Delivered projects within 3 to 6 months using modern web technologies and agile methodologies to ensure high-quality outcomes.",
      "responsibilities": [
        "Developed websites, back-office systems, and mobile applications for B2B clients.",
        "Tested and deployed code to ensure functionality and reliability.",
        "Contributed to the maintenance and evolution of existing projects.",
        "Implemented processes to maintain consistent code quality.",
        "Organized sprints and applied agile principles to improve project delivery."
      ],
      "achievements": [
        "Successfully delivered high-load web applications for clients in various industries.",
        "Streamlined development processes to ensure consistent code quality.",
        "Improved project delivery timelines by adopting agile methodologies."
      ],
      "skills": [
        "PHP 7  ",
        "Symfony 6",
        "React",
        "MySQL",
        "MariaDB",
        "Docker",
        "Kubernetes",
        "API REST",
        "RabbitMQ",
        "Git",
        "Gitlab",
        "Microservices Architecture"
      ],
      "location_type": "Hybrid",
      "highlights": []
    },
    {
      "name": "Castelis",
      "location": "Paris, Île-de-France",
      "location_type": "Hybrid",
      "description": "A company that designs, develops, deploys, and operates innovative and custom digital solutions for clients from all sectors: industrial, tertiary, etc. With a strong team of 85 employees including study and development engineers, cloud engineers, data scientists, project managers, architects, and consultants.",
      "position": "Back end developer",
      "url": "https://www.castelis.com/",
      "startDate": "2020-02-01",
      "endDate": "2021-09-30",
      "summary": "Contributed to the development and deployment of custom digital solutions for diverse industry sectors as part of an 85-person technical team. Worked on backend systems using PHP 5.4 and related technologies while collaborating with cloud engineers, data scientists, and architects to deliver innovative solutions.",
      "responsibilities": [
        "Developed and maintained custom digital solutions for industrial and tertiary sector clients",
        "Implemented backend functionalities using PHP 5.4 and MySQL databases",
        "Built and integrated REST APIs for various client applications",
        "Managed message queuing systems using RabbitMQ",
        "Collaborated with cross-functional teams including cloud engineers and data scientists",
        "Utilized Docker for containerization and deployment",
        "Maintained version control and CI/CD pipelines using Git and GitLab"
      ],
      "achievements": [
        "Successfully delivered custom digital solutions for multiple industry sectors",
        "Contributed to the design and implementation of scalable backend architectures",
        "Improved system integration through effective API development and message queue implementation",
        "Participated in modernizing deployment processes using containerization technologies"
      ],
      "skills": ["PHP 7", "MySQL", "Docker", "API REST", "RabbitMQ", "Git", "Gitlab"],
      "highlights": []
    },
    {
      "name": "Mention",
      "location": "Paris, Île-de-France",
      "location_type": "Hybrid",
      "description": "A social media and web monitoring platform that helps companies track their online presence, brand mentions, competitors, and industry trends across web and social networks. Used by over 750,000 professionals in 125+ countries, including major companies like Spotify, Airbnb, MIT, Microsoft, Lamborghini and Etsy.",
      "position": "Back end developer",
      "url": "https://mention.com",
      "startDate": "2020-02-01",
      "endDate": "2019-04-01",
      "summary": "Contributed to the development of a high-scale social media monitoring platform used by 750,000+ professionals worldwide. Worked on backend systems using PHP 7 and Symfony framework to process and analyze real-time web and social media data, serving clients ranging from startups to enterprise companies like Microsoft and Spotify.",
      "responsibilities": [
        "Developed and maintained real-time monitoring systems for web and social media data",
        "Built backend services using PHP 7 and Symfony framework",
        "Implemented and maintained both REST and GraphQL APIs",
        "Managed high-volume data processing using RabbitMQ message queues",
        "Worked with MySQL databases to handle large-scale data storage and retrieval",
        "Utilized Docker for application containerization and deployment",
        "Contributed to the platform's scalability to support 750,000+ users across 125+ countries"
      ],
      "achievements": [
        "Successfully scaled backend systems to handle monitoring requests from 750,000+ global users",
        "Implemented efficient data processing pipelines for real-time web and social media monitoring",
        "Contributed to the development of both REST and GraphQL APIs to support various client integrations",
        "Helped maintain high availability and performance for enterprise-level clients including Microsoft, Airbnb, and Spotify"
      ],
      "skills": ["PHP 7", "Symfony", "MySQL", "Docker", "API REST", "GraphQL", "RabbitMQ"],
      "highlights": []
    },
    {
      "name": "Youmiam",
      "location": "Paris, Île-de-France",
      "location_type": "Hybrid",
      "description": "A food-tech company partnering with major retailers like Franprix, Auchan, and Frichti.",
      "position": "Back end Developer",
      "url": "https://www.dubruitdanslacuisine.fr/pages/le-blog-du-bruit-dans-la-cuisine",
      "startDate": "2018-02-01",
      "endDate": "2019-02-01",
      "summary": "Managed and developed REST API services for iOS and Android applications while collaborating with major retail partners like Franprix, Auchan, and Frichti. Focused on performance optimization and code quality while contributing to both backend and frontend development tasks.",
      "responsibilities": [
        "Managed REST API development and maintenance for iOS and Android mobile applications",
        "Developed and integrated key features in partnership with major retailers",
        "Identified and implemented performance optimizations to enhance service speed and reliability",
        "Ensured high code quality through comprehensive testing",
        "Contributed to frontend development tasks",
        "Created technical documentation for feature implementations",
        "Collaborated with mobile development team to ensure seamless API integration"
      ],
      "achievements": [
        "Successfully integrated key features for major retail partners including Franprix, Auchan, and Frichti",
        "Improved API performance and reliability through targeted optimizations",
        "Established comprehensive technical documentation processes for feature implementation",
        "Maintained high code quality standards through testing and best practices"
      ],
      "skills": ["PHP 7", "Symfony", "MySQL", "API REST"],
      "highlights": []
    },
    {
      "name": "TWIL - The Wine I Love",
      "location": "Saint-Ouen, Île-de-France",
      "description": "An e-commerce wine platform integrating multiple third-party services and systems.",
      "position": "Back end Developer",
      "url": "https://www.twil.fr/",
      "startDate": "2016-09",
      "endDate": "2018-01-31",
      "summary": "Developed and maintained multiple systems including a Symfony2 back office, Magento e-commerce platform, and mobile app REST API. Managed integrations with various third-party services while ensuring high code quality and reliable deployments.",
      "responsibilities": [
        "Developed new features for Symfony2 back office, Magento e-commerce site, and mobile app REST API",
        "Integrated third-party systems including Mirakl, UPELA, SMoney, and UPS using REST web services",
        "Managed server infrastructure and production deployments",
        "Enhanced system reliability through unit testing and code quality improvements",
        "Contributed to frontend development tasks",
        "Maintained and optimized e-commerce platform performance",
        "Coordinated between multiple systems to ensure seamless operation"
      ],
      "achievements": [
        "Successfully integrated multiple third-party services (Mirakl, UPELA, SMoney, UPS) into the platform",
        "Improved system reliability through enhanced unit testing coverage",
        "Streamlined deployment processes and server management procedures",
        "Maintained high-performance e-commerce operations across multiple platforms"
      ],
      "skills": ["PHP 7", "Symfony", "MySQL", "API REST", "Magento", "API SOAP"],
      "location_type": "Full-time",
      "highlights": []
    }
  ],
  "education": [
    {
      "institution": "ESGI",
      "url": "https://www.esgi.fr/",
      "area": "Web Development and E-Business",
      "studyType": "Master's Degree",
      "startDate": "2014",
      "endDate": "2016",
      "score": "The Web Engineering and e-Business specialization aims to meet industry demand for dual-skilled professionals capable of developing projects and creating value through technology. It provides expertise in three major areas: innovative internet technologies and integration, project management (interfacing with specialized service providers, working in interdisciplinary teams), and e-Commerce operations (marketing strategy, communications, traffic monitoring, SEO, database management, technical maintenance, and navigation usability).",
      "courses": ["dqsdqsd"]
    },
    {
      "institution": "OIIO Formation",
      "url": "https://www.linkedin.com/company/oiio-formation",
      "area": "Computer Science and Web Development",
      "studyType": "European Higher Education Diploma (DEES)",
      "startDate": "2013",
      "endDate": "2014",
      "score": "The European Higher Education Diploma in Webmaster (DEESWEB) is a comprehensive training program that prepares students for Webmaster and Web Designer roles through the study of digital environments and web development techniques, from project management to web development.",
      "courses": []
    },
    {
      "institution": "Lycée Louis Jouvet",
      "url": "https://lyc-louisjouvet-taverny.ac-versailles.fr",
      "area": "Computer Science and Industrial Networks",
      "studyType": "Advanced Technical Diploma (BTS)",
      "startDate": "2010",
      "endDate": "2012",
      "score": "The IRIS Computer Science BTS trains professionals to create and manage complex computer applications and systems for industrial equipment production and technical services. The program covers everything from hardware and software system design to installation, maintenance, and monitoring of IT systems. The IT work is characterized by a close relationship between hardware and software, interaction with industrial and/or technical environments (robotics, Computer-Aided Design CAD, as well as telecommunications and networks).",
      "courses": []
    }
  ],
  "certificates": [],
  "skills": [
    {
      "name": "PHP",
      "level": "Expert",
      "keywords": ["Design", "UI"]
    },
    {
      "name": "Symfony",
      "level": "Expert",
      "keywords": ["Design", "UI"]
    },
    {
      "name": "AdonisJS",
      "level": "Expert",
      "keywords": ["Design", "UI"]
    },
    {
      "name": "TypeScript",
      "level": "Intermediate",
      "keywords": ["Web Development", "Frontend", "Backend", "Fullstack"]
    },
    {
      "name": "Next.js",
      "level": "Beginner",
      "keywords": ["Web Development", "Frontend", "React Framework", "SSR", "Static Generation"]
    },
    {
      "name": "React",
      "level": "Intermediate",
      "keywords": ["Web Development", "Frontend", "JavaScript Library", "UI"]
    },
    {
      "name": "HTML",
      "level": "Intermediate",
      "keywords": ["Web Development", "Frontend"]
    },
    {
      "name": "Docker",
      "level": "Intermediate",
      "keywords": ["Web Development", "Frontend"]
    },
    {
      "name": "RabbitMQ",
      "level": "Intermediate",
      "keywords": ["Web Development", "Frontend"]
    },
    {
      "name": "Api Rest",
      "level": "Intermediate",
      "keywords": ["Web Development", "Frontend"]
    },
    {
      "name": "CSS",
      "level": "Intermediate",
      "keywords": ["Web Development", "Frontend", "Responsive Design"]
    },
    {
      "name": "JavaScript",
      "level": "Intermediate",
      "keywords": ["Web Development", "Frontend", "Backend", "Fullstack"]
    },
    {
      "name": "Tailwind",
      "level": "Intermediate",
      "keywords": ["Web Development", "Frontend", "CSS Framework", "Responsive Design"]
    },
    {
      "name": "Node",
      "level": "Intermediate",
      "keywords": ["Web Development", "Backend", "JavaScript", "Server"]
    },
    {
      "name": "MySQL",
      "level": "Intermediate",
      "keywords": ["Databases", "SQL", "Data Storage", "Backend"]
    },
    {
      "name": "Git",
      "level": "Intermediate",
      "keywords": ["Version Control", "Collaboration", "Source Code"]
    },
    {
      "name": "Gitlab",
      "level": "Intermediate",
      "keywords": ["Version Control", "Collaboration", "Source Code"]
    },
    {
      "name": "GitHub",
      "level": "Intermediate",
      "keywords": ["Version Control", "Collaboration", "Source Code"]
    },
    {
      "name": "Kubernetes",
      "level": "Intermediate",
      "keywords": ["Version Control", "Collaboration", "Source Code"]
    },
    {
      "name": "Ansible",
      "level": "Intermediate",
      "keywords": ["Version Control", "Collaboration", "Source Code"]
    },
    {
      "name": "Docker",
      "level": "Intermediate",
      "keywords": ["Version Control", "Collaboration", "Source Code"]
    }
  ],
  "languages": [
    {
      "language": "French",
      "fluency": "Native speaker"
    },
    {
      "language": "English",
      "fluency": "Intermediate"
    }
  ],
  "interests": [],
  "projects": [
    {
      "name": "Personal Resume",
      "isActive": true,
      "description": "A personal resume website to showcase my projects and skills.",
      "highlights": ["Built with AstroJS and Tailwind CSS", "Includes a blog and contact form"],
      "url": "https://clmntgbr.github.io/resume",
      "github": "https://github.com/clmntgbr/resume"
    },
    {
      "name": "Social Publish Api",
      "isActive": true,
      "description": "A web api that provides social networks publishing skills.",
      "highlights": ["Built with PHP and Symfony", "Api Rest"],
      "url": "https://github.com/clmntgbr/social-pulse-api",
      "github": "https://github.com/clmntgbr/social-pulse-api"
    },
    {
      "name": "Social Publish App",
      "isActive": true,
      "description": "A web app that provides social networks publishing skills.",
      "highlights": ["Built with NextJS", "React"],
      "url": "https://github.com/clmntgbr/social-pulse-web",
      "github": "https://github.com/clmntgbr/social-pulse-web"
    },
    {
      "name": "Symfony Docker",
      "isActive": true,
      "description": "A symfony docker template to build fast api.",
      "highlights": ["Built with Symfony 7.2", "Docker", "Including RabbitMQ and MySQL all under docker"],
      "url": "https://github.com/clmntgbr/symfony-docker",
      "github": "https://github.com/clmntgbr/symfony-docker"
    }
  ]
}
